Revit 2027 API
PipePressureDropData.Viscosity Property
 The dynamic viscosity of the pipe. Units: (kg/(ft·s)).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Viscosity { get; }
Public ReadOnly Property Viscosity As Double
	Get
public:
property double Viscosity {
	double get ();
}
member Viscosity : float with get
Property Value
Double
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace